= The TrumpWorld Graph
////
Entity A Type,Entity A,Entity B Type,Entity B,Connection,Source(s)
Organization,4 SHADOW TREE LANE MEMBER CORP.,Organization,4 SHADOW TREE LANE LLC,Ownership,https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html
////
:gh_url: 'https://raw.githubusercontent.com/BuzzFeedNews/trumpworld/master/data/trumpworld.csv'
:url: 'https://docs.google.com/spreadsheets/u/1/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/export?format=csv&gid=1996904412'
:gdoc: https://docs.google.com/spreadsheets/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/edit
:neo4j-version: 3.1
:author: Michael Hunger
:twitter: @mesirii
:tags: politics,journalism,business-relationships
:img: https://raw.githubusercontent.com/neo4j-contrib/trumpworld-graph/master/img
// :toc: macro

== Importing the Buzzfeed TrumpWorld Dataset into Neo4j

I came across this tweet by Sanchez Castro (@SCHZCAS) which I'm more than happy to support.

++++
<blockquote class="twitter-tweet" data-lang="en"><p lang="en" dir="ltr">Hey <a href="https://twitter.com/neo4j">@neo4j</a> please do this once again!!! <a href="https://twitter.com/hashtag/panamapapers?src=hash">#panamapapers</a> <a href="https://twitter.com/hashtag/neo4j?src=hash">#neo4j</a><br> <a href="https://t.co/B8pjxNKCyA">https://t.co/B8pjxNKCyA</a></p>&mdash; sanchezcastro (@SCHZCAS) <a href="https://twitter.com/SCHZCAS/status/820679713064714241">January 15, 2017</a></blockquote>
<script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script>
++++

As part of the Buzzfeed article https://www.buzzfeed.com/johntemplon/help-us-map-trumpworld?utm_term=.kd5QM0z1q#.ekLzoZ316[Help Us Map TrumpWorld], the four investigative journalists, John Templon, Alex Campbell, Anthony Cormier, and Jeremy Singer-Vine asked the public to help them map and analyze the data that they investigated, confirmed and published:

____
Now we are asking the public to use our data to find connections we may have missed, and to give us context we don’t currently understand. 
We hope you will help us — and the public — learn more about TrumpWorld and how this unprecedented array of businesses might affect public policy.
____

image::https://img.buzzfeed.com/buzzfeed-static/static/2017-01/13/13/asset/buzzfeed-prod-fastlane-01/sub-buzz-31493-1484333437-1.jpg?no-auto[]

// toc::[]

== Setup with Local Database

If you want to work with this data locally, please http://neo4j.com/download[*download and install*] Neo4j 3.1 or use a http://neo4j.com/sandbox[blank Neo4j Sandbox] (of course you can also explore the already imported Trumpworld sandbox).

ifdef::env-graphgist[]
// When using Neo4j Desktop, you can find configuration and directories on the `Options` pane which you open with the button of the same name. 


If you want to *run this guide inside of your Neo4j-Browser*, you can edit the database configuration from the Options pane and add the following setting:

----
browser.remote_content_hostname_whitelist=http://portal.graphgist.org
----

Then restart the database and you're ready to roll, by running this command:

----
:play http://portal.graphgist.org/graph_gists/trumpworld-graph/graph_guide
----
endif::env-graphgist[]

== Looking at the Data

The https://www.buzzfeed.com/johntemplon/help-us-map-trumpworld[Buzzfeed article] linked int he tweet points to a link:{gdoc}[Google Spreadsheet] with collected and verified/researched data of relationships of Trump organizations to other organizations, in total we have 770 organizations (as of today) with 611 relationships.
The same data is available as a CSV and GraphML file in their https://github.com/BuzzFeedNews/trumpworld[GitHub Repository].

The data is fortunately available as a *public* google doc, so we can use our old trick of loading the CSV-Download URL with `LOAD CSV` into Neo4j.

Let's have a look at the data first, here as a sample:

[source,cypher,subs=attributes]
----
WITH 
{url} AS url
LOAD CSV WITH HEADERS FROM url AS row
RETURN row.`Entity A`,row.`Entity A Type`, row.`Entity B`,row.`Entity B Type`,row.Connection, row.`Source(s)`
LIMIT 5
----

//table

ifndef::env-graphgist[]
----
╒════════════════════════════════════╤═════════════════════╤═══════════════════════════════╤═════════════════════╤════════════════╤══════════════════════════════════════════════════════════════════════════════════════╕
│"row.`Entity A`"                    │"row.`Entity A Type`"│"row.`Entity B`"               │"row.`Entity B Type`"│"row.Connection"│"row.`Source(s)`"                                                                     │
╞════════════════════════════════════╪═════════════════════╪═══════════════════════════════╪═════════════════════╪════════════════╪══════════════════════════════════════════════════════════════════════════════════════╡
│"4 SHADOW TREE LANE MEMBER CORP."   │"Organization"       │"4 SHADOW TREE LANE LLC"       │"Organization"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼─────────────────────┼───────────────────────────────┼─────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL DEVELOPMENT ASSOCIATES LLC"│"Organization"       │"40 WALL STREET LLC"           │"Organization"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼─────────────────────┼───────────────────────────────┼─────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL STREET LLC"                │"Organization"       │"40 WALL STREET COMMERCIAL LLC"│"Organization"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼─────────────────────┼───────────────────────────────┼─────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"40 WALL STREET MEMBER CORP."       │"Organization"       │"40 WALL STREET LLC"           │"Organization"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
├────────────────────────────────────┼─────────────────────┼───────────────────────────────┼─────────────────────┼────────────────┼──────────────────────────────────────────────────────────────────────────────────────┤
│"401 MEZZ VENTURE LLC"              │"Organization"       │"401 NORTH WABASH VENTURE LLC" │"Organization"       │"Ownership"     │"https://www.documentcloud.org/documents/2838696-Trump-2016-Financial-Disclosure.html"│
└────────────────────────────────────┴─────────────────────┴───────────────────────────────┴─────────────────────┴────────────────┴──────────────────────────────────────────────────────────────────────────────────────┘
----
endif::env-graphgist[]

The most frequently mentioned organizations found by this query:

[source,cypher,subs=attributes]
----
WITH 
{url} AS url
LOAD CSV WITH HEADERS FROM url AS row
WITH row
WHERE row.`Entity A Type` = 'Organization' AND row.`Entity B Type` = 'Organization'
UNWIND  [row.`Entity A`, row.`Entity B`] AS org
RETURN org, count(*)
ORDER BY count(*) DESC LIMIT 10
----

//table

We see the usual suspect on top.

ifndef::env-graphgist[]
----
╒══════════════════════════════╤══════════╕
│"org"                         │"count(*)"│
╞══════════════════════════════╪══════════╡
│"THRIVE CAPITAL"              │"84"      │
├──────────────────────────────┼──────────┤
│"MERCER FAMILY FOUNDATION"    │"41"      │
├──────────────────────────────┼──────────┤
│"40 WALL STREET LLC"          │"40"      │
├──────────────────────────────┼──────────┤
│"DJT HOLDINGS LLC"            │"35"      │
├──────────────────────────────┼──────────┤
│"KUSHNER COMPANIES"           │"30"      │
├──────────────────────────────┼──────────┤
│"TRUMP HOTELS & CASINO RESORTS│"28"      │
│, INC."                       │          │
├──────────────────────────────┼──────────┤
│"TRUMP TOWER COMMERCIAL LLC"  │"21"      │
├──────────────────────────────┼──────────┤
│"TRUMP ORGANIZATION LLC"      │"18"      │
├──────────────────────────────┼──────────┤
│"THE TRUMP ORGANIZATION, INC."│"13"      │
├──────────────────────────────┼──────────┤
│"TTTT VENTURE LLC"            │"8"       │
└──────────────────────────────┴──────────┘
----
endif::env-graphgist[]

What kind of relationships exist in the data:


[source,cypher,subs=attributes]
----
WITH 
{url} AS url
LOAD CSV WITH HEADERS FROM url AS row
RETURN row.Connection AS type, count(*)
ORDER BY count(*) DESC
----
//table

ifndef::env-graphgist[]
----
╒═══════════════════════════════════════════════════════...═╤══════════╕
│"type"                                                 ... │"count(*)"│
╞═══════════════════════════════════════════════════════...═╪══════════╡
│"President (as of 2016 FEC filing)"                    ... │"475"     │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Ownership"                                            ... │"323"     │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Director"                                             ... │"126"     │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Investor"                                             ... │"120"     │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Reported member"                                      ... │"103"     │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Former director"                                      ... │"66"      │
....                                                    ...
│"\"Kushner and Cui have had an extensive ongoing dialog...i│"1"       │
│te House official,\" per Bloomberg"                    ... │          │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Marino served as Barry's law clerk"                   ... │"1"       │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Former director of African American outreach"         ... │"1"       │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Former director of advance"                           ... │"1"       │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Executive vice president and special counsel to Donald... │"1"       │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Ziya \"awarded a series of multimillion-dollar contrac... │"1"       │
├───────────────────────────────────────────────────────...─┼──────────┤
│"Former deputy director member relations"              ... │"1"       │
└───────────────────────────────────────────────────────...─┴──────────┘
----
endif::env-graphgist[]

While some of them like `Ownership`, or `Investor` are straightforward others (`Ziya \"awarded a series of multimillion-dollar contracts to Azarpassillo,\" per The New Yorker`) are very specific, and probably not a good choice for relationship-type to query on.

So we have *two options*, one could be to use a *generic* relationship and put all the `Connection` information into a property, or *alternatively* we do some cleanup/unification and have a *richer set* of relationships.

== Simple, Direct Data Import

We look at the simpler variant here, to quickly get results.
THe unification approach is http://portal.graphgist.org/graph_gists/834c8437-f713-420d-8c0b-979a2d067485[demonstrated here], for those of you that want to have a bit more interesting graph model.

:LIMIT: 
ifdef::env-graphgist[]
:LIMIT: WITH * LIMIT 150

NOTE: For demonstration purposes in this GraphGist we only load the first 150 entries for each combination of entities.
endif:env-graphgist[]

After creating the two needed constraints, we can directly import the data with Neo4j's `LOAD CSV` command.

//setup
[source,cypher]
----
CREATE CONSTRAINT ON (o:Organization) ASSERT o.name IS UNIQUE;
----

//setup
[source,cypher]
----
CREATE CONSTRAINT ON (p:Person) ASSERT p.name IS UNIQUE;
----

Let's connect the organizations first:

//setup
[source,cypher,subs=attributes]
----
WITH {url} AS url
LOAD CSV WITH HEADERS FROM url AS row
WITH row WHERE row.`Entity A Type` = 'Organization' AND row.`Entity B Type` = 'Organization'
{LIMIT}
MERGE (o1:Organization {name:row.`Entity A`})
MERGE (o2:Organization {name:row.`Entity B`})
CREATE (o1)-[con:CONNECTED_TO]->(o2)
SET con.connection=row.Connection, con.source=row.`Source(s)`
----


Connect people with organizations in both directions:

//setup
[source,cypher,subs=attributes]
----
WITH {url} AS url
LOAD CSV WITH HEADERS FROM url AS row
WITH row WHERE row.`Entity A Type` = 'Person' AND row.`Entity B Type` = 'Organization'
{LIMIT}
MERGE (p:Person {name:row.`Entity A`})
MERGE (o:Organization {name:row.`Entity B`})
CREATE (p)-[con:INVOLVED_WITH]->(o)
SET con.connection=row.Connection, con.source=row.`Source(s)`
----

//setup
[source,cypher,subs=attributes]
----
WITH {url} AS url
LOAD CSV WITH HEADERS FROM url AS row
WITH row WHERE row.`Entity A Type` = 'Organization' AND row.`Entity B Type` = 'Person'
{LIMIT}
MERGE (o:Organization {name:row.`Entity A`})
MERGE (p:Person {name:row.`Entity B`})
CREATE (p)-[con:INVOLVED_WITH]->(o)
SET con.connection=row.Connection, con.source=row.`Source(s)`
----

Connect people with other people from the 3rd tab.

//setup
[source,cypher,subs=attributes]
----
WITH {url} AS url
LOAD CSV WITH HEADERS FROM url AS row
WITH row WHERE row.`Entity A Type` = 'Person' AND row.`Entity B Type` = 'Person'
{LIMIT}
MERGE (p1:Person {name:row.`Entity A`})
MERGE (p2:Person {name:row.`Entity B`})
CREATE (p2)-[con:RELATED_TO]->(p1)
SET con.connection=row.Connection, con.source=row.`Source(s)`
----

Now we have all data of the https://docs.google.com/spreadsheets/d/1Z5Vo5pbvxKJ5XpfALZXvCzW26Cl4we3OaN73K9Ae5Ss/edit#gid=1368567920[Buzzfeed spreadsheet] imported and can start asking some interesting questions.

This is what TrumpWorld looks like.

image::{img}/trumpworld-simple.jpg[]

== Data Enrichment

We can enrich this graph, eg. by labeling organizations:

//setup
[source,cypher,subs=attributes]
----
MATCH (o:Organization)
WHERE o.name CONTAINS "BANK" SET o:Bank
----

We find 17 banks (there are certainly more).


//setup
[source,cypher,subs=attributes]
----
MATCH (o:Organization)
WHERE o.name CONTAINS "HOTEL" SET o:Hotel
----

We find 34 hotels (there are certainly more).


//setup
[source,cypher,subs=attributes]
----
MATCH (o:Organization)
WHERE any(term in ["TRUMP","DT","DJT"] WHERE o.name CONTAINS (term + " ")) 
SET o:Trump
----

We find 405 "Trump" organizations (there are certainly more).

There should be more labeling, but we leave that for later.

== Banks in the Graph

Now we can start running some queries:

E.g. what relationships do banks have to which other organizations in our dataset:

[source,cypher]
----
MATCH (n:Bank)--(o) RETURN *
----

Which YIELDs this interesting graph:

//graph_result

ifndef::env-graphgist[]
image::{img}/trumpworld-simple-banks.jpg[]
endif::env-graphgist[]

== Connections between Organizations

Looking at orgnaizations, *Trump Tower Commercial LLC* and *40 Wall Street LLC* are some of Trump's most prized possessions. 
Let's have a look between and around them.

----
MATCH (o1:Organization {name:"TRUMP TOWER COMMERCIAL LLC"})
MATCH (o2:Organization {name:"40 WALL STREET LLC"})
MATCH path = (o1)-[*..3]-(o2)
RETURN path
----

//graph_result

ifndef::env-graphgist[]
image::{img}/trump-organizations.jpg[]
endif::env-graphgist[]

== Kushner Network

We can now look for instance at the 2nd degree network of "Jared Kushner":

[source,cypher]
----
MATCH network = (:Person {name:"JARED KUSHNER"})-[*..2]-()
RETURN network
----

//graph_result

ifndef::env-graphgist[]
image::{img}/trumpworld-simple-kushner.jpg[]
endif::env-graphgist[]

== Most Connected People

[source,cypher]
----
MATCH (p:Person)-[r]-() 
RETURN p.name, type(r) AS type, count(*) AS degree
ORDER BY degree DESC 
LIMIT 10
----

//table

ifndef::env-graphgist[]
----
╒══════════════════╤═══════════════╤════════╕
│"p.name"          │"type"         │"degree"│
╞══════════════════╪═══════════════╪════════╡
│"DONALD J. TRUMP" │"INVOLVED_WITH"│550     │
├──────────────────┼───────────────┼────────┤
│"WILBUR ROSS"     │"INVOLVED_WITH"│127     │
├──────────────────┼───────────────┼────────┤
│"DONALD J. TRUMP" │"RELATED_TO"   │54      │
├──────────────────┼───────────────┼────────┤
│"BETSY DEVOS"     │"INVOLVED_WITH"│45      │
├──────────────────┼───────────────┼────────┤
│"ELAINE CHAO"     │"INVOLVED_WITH"│36      │
├──────────────────┼───────────────┼────────┤
│"JOSHUA KUSHNER"  │"INVOLVED_WITH"│23      │
├──────────────────┼───────────────┼────────┤
│"REX TILLERSON"   │"INVOLVED_WITH"│20      │
├──────────────────┼───────────────┼────────┤
│"JARED KUSHNER"   │"INVOLVED_WITH"│19      │
├──────────────────┼───────────────┼────────┤
│"DONALD TRUMP JR."│"INVOLVED_WITH"│15      │
├──────────────────┼───────────────┼────────┤
│"BEN CARSON"      │"INVOLVED_WITH"│14      │
└──────────────────┴───────────────┴────────┘
----
endif::env-graphgist[]

== Connection from Putin to Trump

As expected via Rex Tillerson, and Sergei Millian.

[source,cypher]
----
MATCH (vp:Person {name:"VLADIMIR PUTIN"}),(dt:Person {name:"DONALD J. TRUMP"})
MATCH path = allShortestPaths( (vp)-[*]-(dt) )
RETURN path
----

//graph_result

There are also longer connections via other people, if we exclude these two.

[source,cypher]
----
MATCH (vp:Person {name:"VLADIMIR PUTIN"}),(dt:Person {name:"DONALD J. TRUMP"})
MATCH path = allShortestPaths( (vp)-[*]-(dt) ) WHERE none(n in nodes(path) WHERE n.name IN ['REX TILLERSON','SERGEI MILLIAN'])
RETURN path
----

//graph_result


ifndef::env-graphgist[]
image::{img}/trump-putin.jpg[]
endif::env-graphgist[]

So let's check the data.

== Nominees of Trumps Cabinet

[source,cypher]
----
MATCH (p:Person)-[con:RELATED_TO]->()
WHERE con.connection CONTAINS "Nominee"
RETURN p.name, con.connection
ORDER BY p.name ASC
----

// table

ifndef::env-graphgist[]
----
╒═══════════════════════════════╤═══════════════════════════════════════════════════════...╕
│"p.name"                       │"con.connection"                                       ...│
╞═══════════════════════════════╪═══════════════════════════════════════════════════════...╡
│"ALEXANDER ACOSTA"             │"Nominee for Labor Secretary"                          ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"ANDY PUZDER"                  │"Nominee for Secretary of Labor"                       ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"BEN CARSON"                   │"Nominee for Secretary of HUD"                         ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"BETSY DEVOS"                  │"Nominee for Secretary of Education"                   ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"DAN COATS"                    │"Nominee for Director of National Intelligence"        ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"DAVID SHULKIN"                │"Nominee for Secretary of Veterans Affairs"            ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"ELAINE CHAO"                  │"Nominee for Secretary of Transportation"              ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"JAMES MATTIS"                 │"Nominee for Secretary of Defense"                     ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"JEFF SESSIONS"                │"Nominee for Attorney General"                         ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"JOHN F. KELLY"                │"Nominee for Secretary of Department of Homeland Securi...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"LINDA MCMAHON"                │"Nominee for Administrator of the Small Business Admini...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"MICHAEL POMPEO"               │"Nominee for Director of CIA"                          ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"MICK MULVANEY"                │"Nominee for Director of Office of Management and Budge...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"NIKKI HALEY"                  │"Nominee for Ambassador to the United Nations"         ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"REX TILLERSON"                │"Nominee for Secretary of State"                       ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"RICK PERRY"                   │"Nominee for Secretary of Energy"                      ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"ROBERT LIGHTHIZER"            │"Nominee for U.S. Trade Representative"                ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"RYAN ZINKE"                   │"Nominee for Secretary of Interior"                    ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"SCOTT PRUITT"                 │"Nominee for Administrator of the Environmental Protect...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"SONNY PERDUE"                 │"Nominee for Secretary of Agriculture"                 ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"STEVEN MNUCHIN"               │"Nominee for Secretary of Treasury"                    ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"TERRY BRANSTAD"               │"Nominee for Ambassador to China"                      ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"TOM PRICE"                    │"Nominee for Secretary of Health and Human Services"   ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"WALTER J. \"JAY\" CLAYTON III"│"Nominee for SEC Chairman"                             ...│
├───────────────────────────────┼───────────────────────────────────────────────────────...┤
│"WILBUR ROSS"                  │"Nominee for Secretary of Commerce"                    ...│
└───────────────────────────────┴───────────────────────────────────────────────────────...┘
----
endif::env-graphgist[]


Our friends from Linkurious used part of my work for a https://linkurio.us/visualizing-network-donald-trump/[blog post] demonstrating how to visualize this data with their tool. 